# SQL Basics

In [1]:
#configure jupyter notebook to run SQL commands
%load_ext sql

In [2]:
#connect to database
#database is a sqlite database file stored locally, 
#it is a open source db, refer to README for download location
%sql sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite

'Connected: @/Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite'

---

**Basic SELECT, FROM syntax**

In [3]:
%%sql result <<
SELECT Name 
FROM TRACK 
LIMIT 5;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [4]:
result

[('For Those About To Rock (We Salute You)',),
 ('Balls to the Wall',),
 ('Fast As a Shark',),
 ('Restless and Wild',),
 ('Princess of the Dawn',)]

**LIMIT**

In [5]:
%%sql result <<
SELECT Name, Composer, UnitPrice 
FROM TRACK 
LIMIT 5;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [6]:
result

[('For Those About To Rock (We Salute You)', 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 ('Balls to the Wall', None, 0.99),
 ('Fast As a Shark', 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 0.99),
 ('Restless and Wild', 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 0.99),
 ('Princess of the Dawn', 'Deaffy & R.A. Smith-Diesel', 0.99)]

**WHERE**

In [7]:
%%sql result <<
SELECT Name, Composer, UnitPrice 
FROM TRACK 
WHERE UnitPrice > 0.99
LIMIT 5;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [8]:
result

[('Battlestar Galactica: The Story So Far', None, 1.99),
 ('Occupation / Precipice', None, 1.99),
 ('Exodus, Pt. 1', None, 1.99),
 ('Exodus, Pt. 2', None, 1.99),
 ('Collaborators', None, 1.99)]

In [9]:
%%sql result <<
SELECT Name, Composer, UnitPrice 
FROM TRACK 
WHERE UnitPrice > 0.99 AND Name LIKE 'Exodus%';

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [10]:
result

[('Exodus, Pt. 1', None, 1.99),
 ('Exodus, Pt. 2', None, 1.99),
 ('Exodus (Part 1)', None, 1.99),
 ('Exodus (Part 2) [Season Finale]', None, 1.99),
 ('Exodus (Part 3) [Season Finale]', None, 1.99)]

**ORDER BY**

In [11]:
%%sql result <<
SELECT Name, Composer, UnitPrice 
FROM TRACK 
WHERE UnitPrice > 0.99 AND Name LIKE 'Exodus%'
ORDER BY Name;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [12]:
result

[('Exodus (Part 1)', None, 1.99),
 ('Exodus (Part 2) [Season Finale]', None, 1.99),
 ('Exodus (Part 3) [Season Finale]', None, 1.99),
 ('Exodus, Pt. 1', None, 1.99),
 ('Exodus, Pt. 2', None, 1.99)]